In [22]:
import pandas as pd
ser = pd.Series(data=[100,200,300,400,500], index=['tom','ali','bob','jen','mira'])

In [23]:
ser

tom     100
ali     200
bob     300
jen     400
mira    500
dtype: int64

In [24]:
ser.index

Index(['tom', 'ali', 'bob', 'jen', 'mira'], dtype='object')

In [25]:
ser['ali']

200

In [26]:
ser[[4,3,1]]

mira    500
jen     400
ali     200
dtype: int64

In [27]:
ser.loc['ali']

200

In [28]:
'ali' in ser

True

In [29]:
ser * 2

tom      200
ali      400
bob      600
jen      800
mira    1000
dtype: int64

In [30]:
ser ** 2

tom      10000
ali      40000
bob      90000
jen     160000
mira    250000
dtype: int64

Pandas DataFrames

In [36]:
d = {'one': pd.Series(data=[100.,150.,170.], index=['apple','peach','cherry']),
     'two': pd.Series(data=[100.,150.,170.], index=['table','apple','pen'])}

In [37]:
df = pd.DataFrame(d)

In [38]:
df

          one    two
apple   100.0  150.0
cherry  170.0    NaN
peach   150.0    NaN
pen       NaN  170.0
table     NaN  100.0

In [39]:
df.index

Index(['apple', 'cherry', 'peach', 'pen', 'table'], dtype='object')

In [40]:
df.columns

Index(['one', 'two'], dtype='object')

In [41]:
pd.DataFrame(d,index=['apple','pen'])

         one    two
apple  100.0  150.0
pen      NaN  170.0

In [42]:
df['three'] = df['one'] * df['two']
df

          one    two    three
apple   100.0  150.0  15000.0
cherry  170.0    NaN      NaN
peach   150.0    NaN      NaN
pen       NaN  170.0      NaN
table     NaN  100.0      NaN